[
    {
        "Title": "Why si the Russian Ukraine war so slow ",
        "Body/Content": " Is this the reality of wars that it takes so long with no progress ",
        "Post ID": "1g1f3jp",
        "Subreddit": "geopolitics",
        "Date/Time": "2024-10-11 17:22:03",
        "Score": 0,
        "Number of Comments": 2
    },
    {
        "Title": "Russia's Putin cements ties with Iranian president in Central Asia meeting",
        "Body/Content": "",
        "Post ID": "1g1c7df",
        "Subreddit": "geopolitics",
        "Date/Time": "2024-10-11 15:16:45",
        "Score": 3,
        "Number of Comments": 1
    },
    {
        "Title": "Hezbollah Waged War Against the People of My Country",
        "Body/Content": "",
        "Post ID": "1g1bk9i",
        "Subreddit": "geopolitics",
        "Date/Time": "2024-10-11 14:48:58",
        "Score": 40,
        "Number of Comments": 14
    },
    {
        "Title": "The Brewing War With Israel Is Boosting Iran’s Young Hard-Liners: Regional Conflict Favors Extremists in the IRGC",
        "Body/Content": "",
        "Post ID": "1g1azwp",
        "Subreddit": "geopolitics",
        "Date/Time": "2024-10-11 14:23:39",
        "Score": 8,
        "Number of Comments": 3
    },
    {
        "Title": "What’s your perspective on the stance of Gulf countries like the UAE, Saudi Arabia, Jordan, and Egypt regarding the Israel-Palestine and Iran conflicts? Do these nations genuinely care about Iran and the Palestinians, or is it just a facade?",
        "Body/Content": " Do the Gulf countries like the UAE, Saudi Arabia, Jordan, and Egypt genuinely care about Palestine and its people? Despite their claims of support, I haven't seen any strong stance taken against Israel. Most of these countries aren't accepting Palestinian migrants either. Are they merely allowing Israel to continue its actions against Palestine and now Iran? Have these nations normalized relations with Israel through agreements like the Abraham Accords?",
        "Post ID": "1g130q7",
        "Subreddit": "geopolitics",
        "Date/Time": "2024-10-11 05:54:59",
        "Score": 37,
        "Number of Comments": 44
    }
]