[
    {
        "title": "AITA when I told her to cut her family off.",
        "url": "https://www.reddit.com/r/AITA_WIBTA_PUBLIC/comments/1gkyahf/aita_when_i_told_her_to_cut_her_family_off/",
        "comments": [
            "NTA and sadly your wife should have cut them out of her life a long time ago",
            "NTA. Just go NC. They won’t come to their senses. And I guarantee you they won’t even contact her….until they need something.",
            "NTA. No one NEEDS a new phone everytime a new one comes out. That is a want. Your child has needs, which you are justified in reasoning to them. Cut them off. You and your wife don't need that entitlement in your life.",
            "NTA\n\nNot at all, they sound toxic, and honestly going no contact will you both the hassle of SIL constantly harassing you for money and other stuff.\n\nAlso it’s best to duck out now, before SIL has a kid, and then OP’s daughter gets relegated to second choice. \n\nI have been the child of the non-golden child , and its was constantly being ignore by my grandmother, and the and second she pays attention to me, I needed to be extremely grateful for her any crumbs she gave me.",
            "Good grief- go NC.",
            "They sound awful tbh, I think she'd be better off or the lowest contact there is. But... it's your wife's decision.\n\nThat said, NTA for suggesting it",
            "Tell her she needs to cut them off for good because they don't give a shit about her and they will NEVER come around. SIL is a spoilt immature brat.",
            "NTA\nWhy allow chaos into your lives.",
            "NTA thank you for trying to protect your wife’s peace.",
            "NTA. If it's so important that MIL is now involved, why can't she pay 1/2? Why is it her older sister has to pay? Oh, she has money now. She has control now. Mummy & SIL don't get to reap the rewards of hard work. \n\nYou have a great idea. Go NC for a few weeks. Unless you're in the US, Thanksgiving is coming up. Holidays, yeck. If they want to throw a fit over not paying for 1/2 her phone, let them. Enjoy the peace. Whose GOLDEN now lil sis? Don't like it? Get over it, it's a thing called life and responsibility.\n\nBest wishes.",
            "NTAH. \n\nThere's a lot of trauma there. She needs to let them go. She can love them at a distance. She definitely needs to set boundaries and pull away. \nShe now has the ability to break the cycle, heal her inner child, and show her own baby a better life than what she got.  \nThe first step is cutting out the poison her mother and sister bring.",
            "NTA but they won't contact her until they need something",
            "In laws are narcissists. Cut them off completely. They have nothing to offer your family, only take.",
            "NTA! The audacity of that b!€#! \nI think you should cut them out, they are psyco. Move faaaaaar awsy and don't let thrm near your eife ir daughter.",
            "Oh, so the trash took itself out.  Continue with the same energy they show her.  Take it one step further and go NC completely.  They are toxic.  Thank you for sticking up for your mistreated wife."
        ]
    },
    {
        "title": "Need help choosing 3060ti or 3070",
        "url": "https://www.reddit.com/r/pcmasterrace/comments/pcmgvz/need_help_choosing_3060ti_or_3070/",
        "comments": [
            "What monitor do you have?",
            "SAMSUNG C24F390 24\"\" :)",
            "Considering a 3070 for that set up is the effect of good marketing. \n\nGet the 3060ti, your monitor is going to be a massive bottleneck, followed by your CPU. Save the money and put it towards other upgrades like a 27” 144Hz (which a 3060Ti will run fine btw)",
            "Thaks you so much :3",
            "No prob and thanks for the award!"
        ]
    },
    {
        "title": "iphone14 pro max worth it or should i wait for the iphone 16?",
        "url": "https://www.reddit.com/r/iphone14/comments/1b8daf7/iphone14_pro_max_worth_it_or_should_i_wait_for/",
        "comments": [
            "Do you need a new phone right now? Do you want to stay with lighting for the next few years? Can you pick it up from a reputable seller/decent price? If so, get the 14 PM. The 13/14 will be supported for a few more major updates at least, I wouldn’t worry about that. They are only getting better as time goes on. \n\nIf you can wait, then hold off until the 16 comes out.",
            "I chose 14 pro for the AOD, Dynamic Island, and 48mp camera, but if u don’t care about those things, I’d recommend 13 pro max all day, it’s got a better battery than any other iPhone imo, and best-overall rounded phone. Both phones are more than enough imo. 16 will be polished Titanium (I like stainless steel better), have an action button, way thinner screen borders, better battery, AI, capture button, and better cameras. I don’t think it’s worth it unless you want the best possible battery (maybe 2 days)",
            "16 gonna be better ike how15 is better than 13 pm",
            "well, my phone is dying pretty quick, i dont mind lightning, my apple pencil& my old ipad are still using it, i wanna buy it from backmarket, so im paying a decent price ( iphone13 pro max for 861€ in blue or the 14 pro max for 960€ in purple, both with excellent condition, the 14 pro max not with a new battery tho )",
            "I’d go for it then!",
            "would you pick up the 13 pro max, or the 14 pro max? can send you the link of both if you want",
            "https://www.backmarket.de/de-de/p/gb/3a4a66ed-b058-4393-a14b-db194066bf48#l=10&scroll=false THATS THE 14 PRO MAX\n\nhttps://www.backmarket.de/de-de/p/iphone-13-pro-max-128-gb-sierrablau-ohne-vertrag/5becd0a2-df06-4ca8-8d3b-b0bb11697fbf AND THATS IS THE 13 PRO MAX, ONLY THIS ONE GOT A NEW BATTERY",
            "I don’t think you can go wrong honestly! Both are great phones. If money is not a concern, the 14 PM is newer with a camera refresh. If Apple continues their update cycle, you’ll get an extra year of updates. The 13 PM has some bang for your buck as well, the new battery is nice, you shouldn’t have to worry about replacing it",
            "thanks for answering^^ do you think the price is gonna drop significantly when the iphone 16 comes out? probably gonna go for the 14PM, depending on their update cycle, how long is this cycle?",
            "Hard to say on the reseller market, usually you can expect a $100 drop when Apple releases.. I’m not sure if that translates over to resale or not. I would assume you’d see some price drop though!"
        ]
    },
    {
        "title": "Brand new iphone unavailable, don't know the passcode, can't restore?",
        "url": "https://www.reddit.com/r/iphone/comments/1gea7xs/brand_new_iphone_unavailable_dont_know_the/",
        "comments": [
            "Alright guys, it did restore! Think the issue was my mac running on fumes disk space wise, I was surprised there was no feedback at all and the process just stopped. Cleaned up like 30gb just in case and this time it worked!",
            ">  How bad is this?\n\nBad. You'll want to call AppleCare and/or take the phone to an Apple store to see if they can do anything or try to restore it on one of their computers. If they can't do it, the phone is useless. It is incredibly hard to get into an iPhone when you forget the password and have no way of resetting it via your AppleID. If your friend really did set up a password and then forget it, sounds like that friend owes you a phone. \n\nI take it you have proof of purchase and all of that?",
            "[deleted]",
            "Yeah I do, but since it was bought in another country i'm not sure they will honor it but at least I can try. Thank you, will keep you posted!",
            "Well if that was someone's phone it would be probably registered in 'find my' and ruined my \"theft\" plan dude and thats not the case. Im just following a manual on official apple support and its not working, not sure how to convince you, you want to see the bill for it?"
        ]
    },
    {
        "title": "Twice Daily Journo Requests - 10/21/2024",
        "url": "https://www.reddit.com/r/DigitalPR/comments/1g90br9/twice_daily_journo_requests_10212024/",
        "comments": []
    }
]