[
    "Key Topics: proud, roman. Sulla was a brutal dictator that did more to destroy the fabric of the republic, in the name of restoring it, than any other person did. He almost got Caesar killed for basically being married to the wrong girl. Reform the Roman army is what he did, give more rights to Italians he did. In this house, GAIUS MARIUS IS A HERO.",
    "Key Topics: roman, boomer, easy. Rough Roman Forum Discord server I am a bot, and this action was performed automatically. Please contact the moderators of this subredditmessagecomposetorRoughRomanMemes if you have any questions or concerns. Title: Those roman boomers had it easier. How do you know that the interview process at that time didnt suck, or that people didnt consider you a loser for being unemployed? Also how do you get past the. barrier at that period of time? How do you explain to your friends that you were unemployed at the time?",
    "Key Topics: favourite, TFW, Rome, total, war. The thing with the gold never happened to Crassus. Its a popular myth. It was Manius Aquilius who was executed in that manner by Mithridathes. I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
    "Key Topics: roman, conquest, Greece, like. RoughRomanMemes is a subreddit dedicated to the history and culture of the Roman Empire. This post was submitted by a citizen of the subreddit. I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
    "Key Topics: everytime, study, roman, history. Everytime I study Roman history. How are these guys still around. You start AFTER Scipio And miss the seven kings The revolution of Brutus The first sack of Rome The Samnite wars The glories of Cincinnatus For me the most interesting time was the 5th century hands down.",
    "Key Topics: need, good, Roman, Movie, Hollywood. We need a good Caesar in Gaul movie. Pointing your bow at people 2 feet away like its a gun. Dont forget catapults and scorpios that fire as fast as machine guns. Heres a letter written by a Roman legionary from Egypt stationed in Italy Apion to his father and lord Epimachos Many good wishes. \"I want a movie based on that. Not like this dude specifically, but a groundup, slice of life portrait of the average Roman soldier. Provincial joins the mighty legion, travels across the known world, ends up in a famous battle. Learns the horrors of war and how big the world is\"",
    "Key Topics: bad, people, roman, like, need. I call it Romania, both because thats what they called it at the time and also because it is unnecessarily confusing. I call it Byzantium because I think its an awesome name. Its less clunky than Eastern Roman Empire. Come join the Rough Roman Forum Discord server.",
    "Key Topics: rich, people, roman, history, hate. Most of the political power the Emperors had were derived from them being the Tribune of Plebs. But no, Marcus Aurelius apparently wanted some grizzled general fellow to inherit his powers and then pass them onto the kind old men of the senate. Nobody talks about how fuckin dumb that is. Found the background to this picture in one of his youtube videos, actually bloody mental how he does it. Most written history is rich people squabbling with rich people. This one is a bit different. It's just a little bit of the history of the United States.",
    "Key Topics: gaul, sub, open, rebellion, roman. There is now a gaul sub. This is an open rebellion romans.. Thank you for your submission, citizen. Come join the Rough Roman Forum Discord server I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit with any questions or concerns.",
    "Key Topics: rightful, roman, land. Rough Roman Forum Discord server I am a bot, and this action was performed automatically. Please contact the moderators of this subredditmessagecomposetorRoughRomanMemes if you have any questions or concerns. CRIMEA BELONGS TO THE GREEKS Taurica Romana Est I like my Crimea Golden.",
    "Key Topics: roman, engineering, fine. This is hilarious not gonna lie. But I dont know how I feel about Vercingetorix being depicted as the brainlet. I always view the fall of the king of the gauls as a tragedy. Theres something so alluring about his story.",
    "Key Topics: well, good, old, roman, art. Nothing better than some good old Roman art. Hey man, YOU try drawing the front profile of a horse. Bored monks make the funniest shit up in manuscripts. I love how worried that horse looks. There is undoubtedly shitty roman art too.",
    "Key Topics: petition, change, number, subreddit, roman. I support this, until the day this becomes a fully Latinized sub. People will now reply to me in random latin phrases that I dont understand and Ill be forced to translate them. Ignore the Senate, take this to the assembly at once Also change upvotes to thumbs down and downvoted to thumbs up.",
    "Key Topics: roman, Emperor, Political, Compass. This is the best political compass Ive ever seen. Caligula made too much sense. The Nerva one had me laughing my ass off. DO NOT GOOGLE THE LITTLE FISHES This is the most interesting show I've seen in a long time.",
    "Key Topics: explain, roman, history, banana, ripeness. The Russian empire successor of the Roman empire would be a moldy potato right Then theres mussolinis new roman empire, which is a painting of a banana made using shit as paint. Damn that ERE is good eating. But but but Mr German man conquered Rome and was crowned by the pope because of the implication His was the true Rome. German barbarians larped as Romans 300 years after the empire collapsed. direct continuation of the empire is more legitimate than the one that was founded by German barbarians. The empire was established by the Romans, not the barbarians, and the empire was not founded by the Germans.",
    "Key Topics: Byzantines, story, continuous, decline, Eastern. The Eastern Roman Empire was a story of continuous decline. Justinians Renovatio Imperii, Macedonian Renaissance, and Komnenian Restoration would beg to disagree. Each revival came at the cost of losing a significant portion of its territory.",
    "Key Topics: disrespect, Roman, Empire. The Roman Empire were basically The only tolerant people out there. As long as you had a shrine for The imperial cult you were free to do almost whatever for your own gods. Genocide literally killed, raped, and enslaved the entire Carthage population before burning the city to the ground. To celebrate the new year I decided to open a instagram account Where I will only post 100 original Roman memes, I will keep posting here, but check it out if you like my rough roman memes. I will try to post 3 new memes every week, no reposts I promise. projecting modern values onto ancient societies doesnt really mean anything.",
    "Key Topics: read, ancient, jewish, text, different. Reading the ancient Jewish texts on the different Roman emperors is really entertaining. Antoninus Pius was switched as a baby with Rabbi Yehuda Hanasi. He became friends with him later in life and was good to the Jews. Compared to his predecessor Hadrian, he must have seemed like an angel.",
    "Key Topics: Happy, Floralia, Roman, Empire, celebrate. Floralia was a festival that started on April 28th. By the beginning of the reign of Augustus it had become as popular a holiday to the Romans as Saturnalia. On May 3rd, the last day of the festivities, prostitutes would strip in the arena and perform erotic dances. Biggus Dickus Yall stopped celebrating this. Which ones stopped celebrating it? Let us know in the comments below. Back to Mail Online home. Back into the page you came from. Back To the page where you came From. Click here for more information.",
    "Key Topics: Romans, reason, season. The use of damnatio ad bestias against Christians began in the 1st century AD. Tacitus states that during the first persecution of Christians under the reign of Nero after the Fire of Rome in AD 64, people were wrapped in animal skins and thrown to dogs. Application of damnatio ad bestias to Christians was intended to equate them with the worst criminals, who were usually punished this way. According to Roman laws, Christians were 1. Guilty of high treason majestatis rei 1. For their worship Christians gathered in secret and at night, making unlawful assembly. Gladiatorial combat was first featured at the Roman Forum and then transferred to the amphitheaters. lions, other animals were used for this purpose, including dogs, wolves, bears, leopards, tigers, hyenas, and crocodiles.",
    "Key Topics: roman, subreddit, barbarian, filth. As a moderator policy, we remove Charlemagne posts that dont also involve the Byzantines or something. The Carolingian Empire is offtopic except as it enters into Roman history. I personally like the Franks and their history quite a bit but allowing every imperial claimant muddies the topic. Claudius told people to not expand any further because it would become ungovernable. Britannia became a permanent source of military rebellions and a drain on the economy. So he would have admired the pragmatism of Diocletian dividing the empire, and given Charlemagne some cred for restoring the West temporarily.",
    "Key Topics: late, Roman, silly, movie, vs. Late Roman in silly movie vs Real late roman legionary. Is this a take on Eagle of the Ninth his arch nemesis other Romans? No goth gf unlike other legionaries no roman gf cause poor Commander tells me to acclaim him imperator so that no more raid and better pay.",
    "Key Topics: official, Tiers, Roman, Fanaticism, take. Ive made The Official TOP 10 Tiers of Roman Fanaticism, this took some time so I hope you like it. If you are below tier 6 I dont know WTF are you even doing in this sub. I was going to start doing memes about lesser know topics like The 2 pyramids of Rome I will post it soon. I am usually tier 8. currently reuniting an army to take over Italy, want to join. Then i will reread my copy of the Commentarii for the 50th time and as my pulse quickens, my hands shake and i begin to sweat, my hair becomes curly, i dress myself in purple, and oh my i feel like im becoming a god tier 10.",
    "Key Topics: Wtf, Romans, context, comment. During the first Gaulic sack of Rome, the guard dogs failed to alert the Romans that the Gauls were coming. Because of this, during the Roman holiday of supplicia canum punishment of the dogs, the Romans would torture and crucify hundreds of dogs, while they would parade geese as heroes.",
    "Key Topics: Romans, peak, civilization. I wipe my ass with a sponge on a stick. Not as bad as Ancient Sumerians who had to use toilet clay tablets because paper wasnt invented yet. I hate toilet paper, its coarse and rough and irritating. I cant really believe they all used the same sponge. full of bacteria, imagine the infections both anally and urinary tracts.",
    "Key Topics: chinese, village, Zhelaizhai, claim, descendant. The Chinese village of Zhelaizhai claims to be the descendants of Romans captured at Carrhae. While they might be the actual genetic descenants of those Romans, the book Silk Routes and the Roman Empire by Rauol McLaughin posits that some Roman soldiers from Crassuss legions escaped to China.",
    "Key Topics: Romans. The Roman part in Holy Roman Empire seems to have been more of a political identity it was the empire of the emperor of the romans than an actual cultural or popular one. Your average guy in the HRE would consider himself a BavarianBohemianItalianwhateverian if no even narrower regional descriptors.  reddit seems to care a lot more about the Who is the emperor BS than any actual emperor ever did. And where are the Romans now? Youre lookin at em. Youre looking at em now. You're looking at them now.",
    "Key Topics: roman. RoughRomanMemes when RomabooRamblings actually defends the HRE Now thats dark, lol At my school the teacher didnt called it Holy Roman Empire. She called it German Empire. But never HRE the holy roman empire is so chaotic you probably are clinically insane if you are an expert.",
    "Key Topics: job, Virgin, modern, vs, Chad. Virgin modern jobs vs Chad Roman jobs. How Does dwarf seller work Were they sold as slaves. Does the seller breed them or kidnap them Based. on epic Ancient Roman jobs weighted by likelihood Farmer, soldier, slave, farmer, craftsman, prostitute, farmer.",
    "Key Topics: Roman, Emperors, RANKED, show, Dovahhatty. This is an impressively wrong list, from top to bottom. Claudius behind Caligula and Nero is insanity Antoninus Pius in B tier hol up. Vespasian should be in S tier. He stabilised the empires finances and settled things down.",
    "Key Topics: Ppl, appropriate, Greco, roman, aesthetic. Ppl who appropriate GrecoRoman aesthetics for fascist purposes give us all a bad name and must be called out. This is your daily reminder that bringing the Roman Empire back now would be utterly useless. Restoration would literally just be renaming Italy. And he was chased like a hooligan and the Senate was soo frustrated with his shenanigans that they elected the oldest, meanest, most conservative man in the empire to be Emperor.",
    "Key Topics: Romans, everybody, wanna, emperor, speak. Greek and Latin came to be seen as equal pretty early on as the empire reached its peak. Suetonius biography of Claudius has the emperor comment on a barbarian knowing both Greek and Latin that you know both our languages Claudius 42.2. Byzantines are literally romans.",
    "Key Topics: sad, restore, Roman, Empire. Bro thought the Roman Empire still existed until his late adulthood. Sadly I learned about it during childhood. I am a bot, and this action was performed automatically. Please contact the moderators of this subredditmessagecomposetorRoughRomanMemes if you have any questions.",
    "Key Topics: roman, imaginary, girlfriend, tragedy. Female ancient historian in love with the glory of Ancient Rome. Shows a Greek statue being displayed in a French museum. Interesting choice. You could always introduce your girlfriend later on to the Glory of Rome. Aight there was no need to come at me like this I actually found a girl in college who loves history how do I not mess it up boys.",
    "Key Topics: start, learn, roman, history, right. Start learning Roman history RIGHT NOW. Is depressed and doesnt know why I know why. Its because Rome fell. Millennials College Why are you reading this comment instead of learning Roman History. As always here is my instagram for more original rough roman memes.",
    "Key Topics: roman, persian, war, long, lasting. The Roman Persian wars are one of the longest lasting conflicts in history. Rome sacked the Persian heartland and conquered their capital several times. Persia did not. fight for one million billion trillion years only to be decimated by some desert nomads in no time. Real third Rome moment. from behind and wipes out the Persians in like five minutes. Ottomans were constantly at war with persia too. Real third Rome Moment. frombehind and wipesout the Persian in like 5 minutes.",
    "Key Topics: City, ah, yes, capital, Roman. Ravenna is dope AF. I was there a month ago and utterly enjoyed it. It held up to sieges for literal YEARS. It was a better capitol in every practical way than Rome ever was. Mediolanum, though it was only the capital under Emperor Maximian.",
    "Key Topics: roman. If I have to choose between one Cristian rome and another I will always choose the one that actualy was Roman Empire ergo Eastern Roman Empire. Frederick Barbarossa calling Manuel Komnenos emperor of the Greeks and how hes actually a vassal to the HRE through some weird mumbo jumbo.",
    "Key Topics: roman, invasion, Britain, like. Rough Roman Forum Discord server I am a bot, and this action was performed automatically. Please contact the moderators of this subredditmessagecomposetorRoughRomanMemes if you have any questions or concerns. History Matters actually did a pretty good video on why the Romans didnt conquer Ireland.",
    "Key Topics: lo, fi, roman, girl. This art piece was made by Centurii chan. Title: Lo fi Roman girl. Lofi Imperial beats to praise Caesar and slay barbarians to It looks more renaissance rather than classical roman period. Still pretty amazing artwork. Follow himher for more content like this.",
    "Key Topics: Official, Roman. RoughRomanMemes.com is an official account of the Rough Roman forum. Official Roman accounts are created by the forum's moderators. This post was submitted by a bot. Please contact the moderators of this subreddit if you have any questions or concerns.",
    "Key Topics: Evolution, roman, helmet. The evolution of Roman helmet. Early Imperial Drip I was not prepared to see a twink janissary today These are really cool drawings did you do this Veles What you know about rocking a wolf on your noggin I really like the Late RomanByzantine helmets.",
    "Key Topics: Iliad, popular, book, antiquity, make. The Iliad was the most popular book in antiquity making up to a quarter of all Roman texts. As it should. Peak fiction. Wheres the Odyssey how the fuck are we to know the proportion of books What is Aeschines most known for Its the only Greek author I dont know that is in this graph.",
    "Key Topics: Mid, Roman, Republic, base, fuck. A single battle like one of the ones in these memes and a state would pretty much fall over and concede defeat. Rome was able to win not simply because they had a large population. It was their extensive network of allies that they had forged after they defeated the local Italians. The romans didnt really seemed to be aware of the ramifications of their unique way of dealing with its enemies after their defeat. Basically they didnt demand tribute from the Italians. Instead demanding supplies and men in times of war and simply paying taxes. Pretty good deal for most nations for the time.",
    "Key Topics: roman, history. RoughRomanMemes: What part of Roman history is the first time Caligula was emperor? Rough Roman Forum: Come join the Rough Roman forum Discord server I am a bot, and this action was performed automatically. Please contact the moderators of this subredditmessagecomposetorRough RomanMemes with any questions or concerns.",
    "Key Topics: guide, ambitious, roman, general. A guide for the ambitious Roman general. The Arabs causing us trouble later on. Yeah like they could possibly threaten our wealthiest provinces of Egypt and Syria. No I think I will take my legions to try and conquer Persia for the 324th time. I dont think Heraclius wanted to be Alexander Good meme 810 Small correction, Trajan is titularly referred to as Optimus, not Maximus.",
    "Key Topics: Romans, study, final. The fall of the western Roman Empire was caused by a series of waves of invaders. It had less to do with corruption or morality and more with a lack of good emperors and generals due to so many invaders. Attila in the 440s was devastating to the empire. After studying Hellenistic history especially the Diadochi wars, it made me realize that looking at history from a modern perspective influenced by EU4 states are borders on a map is wrong. States are surprisingly fluid and unlike today most people didnt really have a nationalistic or patriotic connection to the state they were a part of.",
    "Key Topics: fuck, zodiac, sign, roman, nickname. I call the New York Yankees the Glaborus Northerners since they have a strict shaving policy. Plautus the big eared I wonder if Marcus Licinius Crassus was actually fat Caesar hairy. Also Fabius bean farmer.",
    "Key Topics: Romans. Romania, the nation that really clings to Ancient Rome in terms of language, is constantly forgotten as the Romance languages. Its funny how Romania is named after the Romans when it was the place which spent the least amount of time actually in the Roman Empire.",
    "Key Topics: guy, well. These guys used to be so much better back then. The firemen that would extort you as your house was burning down Those firemen gets his head used as a theater prop by the people who killed him. reads better in title reads put down slave rebellion in image What the fuck op lol Give it a few years and billionaires will be raising private armies once more."
]